content/blog/blogging-with-org-mode-and-ox-hugo.md
+++
title = "Blogging with org-mode and ox-hugo"
author = ["Shane Sveller"]
date = 2018-02-13T12:30:00-06:00
lastmod = 2018-02-13T12:28:03-06:00
tags = ["hugo", "netlify", "org", "spacemacs"]
categories = ["emacs"]
draft = false
+++

I've recently assembled a workflow for blogging with [Hugo](https://gohugo.io/), [org-mode](http://orgmode.org/), and
[Netlify](https://www.netlify.com/) via a single `.org` document, with live reload during writing and `git
    push` driven deployments.

<!--more-->


## Requirements {#requirements}

I've detailed my current environment in the
[Software/Tool Versions](#ox-hugo-software-tool-versions) appendix below.
Strictly speaking, the hard requirements of the
[ox-hugo](https://melpa.org/#/ox-hugo) package are:

-   Emacs 24.4+
-   org-mode 9.0+

To use the `git`-based publishing part of this workflow, you'll also need:

-   A GitHub account (free or otherwise)
-   A Netlify account (free or otherwise)


## Features {#features}

-   Compose and organize content in a single Org file
-   Each post automatically gets a Table of Contents if sub-headings are present
-   Preview in your local browser including live-reload behavior
-   Syntax highlighting, including custom line numbers and line highlights
-   Manage draft / publication status
-   Manage categories and tags
-   Manage post aliases
-   Manage custom front-matter
-   Publish via `git push`, perhaps via [Magit](https://magit.vc/)
-   Free hosting via Netlify (dear Netlify, please let me give you money
    without a multi-user/Pro account!)
-   Free HTTPS via Netlify's Lets Encrypt integration


## Installation {#installation}

I've included snippets for `use-package` users and Spacemacs users - others
should look at the [repository](https://github.com/kaushalmodi/ox-hugo) for the `ox-hugo` package for more
information.


### `use-package` Users {#use-package-users}

```emacs-lisp
(use-package ox-hugo
  :after ox)
```


### Spacemacs Users {#spacemacs-users}

Use <kbd> SPC f e d </kbd> to open `~/.spacemacs` (or
`~/.spacemacs/init.el`) and within the `dotspacemacs/layers` function, add or
update an entry to the `dotspacemacs-configuration-layers` list like so:

```emacs-lisp
(org :variables
     org-enable-hugo-support t)
```

Restart Emacs or use <kbd> SPC f e R </kbd> to reload your
configuration on-the-fly. If you already have an entry for the `org` layer,
just include the variable `org-enable-hugo-support` with value `t`.


## Workflow {#workflow}


### Project Structure {#project-structure}

I'm working within a vanilla Hugo project with the following structure,
similar to what you'd see right after a `hugo new site` command:

```sh
$ tree -d -L 2
.
├── archetypes
├── content
│   ├── blog
│   └── pages
├── data
├── layouts
├── static
│   └── images
└── themes
    └── hugo-redlounge
```

My `blog.org` file sits at the root of my repository, but could be placed
nearly anywhere within and re-targeted with the `HUGO_BASE_DIR` setting.
Subtrees get exported to a subdirectory of `content` based on their
`EXPORT_HUGO_SECTION` property.


### File Structure {#file-structure}

There are several options for organizing the `.org` file you store your
blog posts and pages in, but here's a single-file structure that works
well for me.


#### Global settings and metadata {#global-settings-and-metadata}

{{< highlight org "linenos=table, linenostart=1" >}}
#+STARTUP: content
#+AUTHOR: Shane Sveller
#+HUGO_BASE_DIR: .
#+HUGO_AUTO_SET_LASTMOD: t
{{< /highlight >}}

Line 1 is an `org-mode` setting that tells Emacs that upon opening this
file, default to showing all headings and subheadings but not the inner
content until <kbd> TAB </kbd> is pressed while the
pointer is on a particular heading.

Line 2 sets my global author information, which propagates into each post
and page I manage with this `.org` file.

Line 3 tells `ox-hugo` that the current `.org` file is located in the
root of the overall Hugo project, which means that exported data will
be saved into the `content` directory and appropriate subdirectory that
reside next to the `.org` file. Relative and absolute paths both work here.

Finally line 4 tells `ox-hugo` to update the `lastmod` property of each
exported item to match the current time and date, which can be reflected
on your site in various ways based on your theme and configuration.


#### Creating a page {#creating-a-page}

{{< highlight org "linenos=table, linenostart=5" >}}
* Pages
  :PROPERTIES:
  :EXPORT_HUGO_CUSTOM_FRONT_MATTER: :noauthor true :nocomment true :nodate true :nopaging true :noread true
  :EXPORT_HUGO_MENU: :menu main
  :EXPORT_HUGO_SECTION: pages
  :EXPORT_HUGO_WEIGHT: auto
  :END:
{{< /highlight >}}

My `.org` file has a dedicated top-level Org heading to contain my `Page`
content, and this heading sets a number of shared **properties** that are
inherited by the individual sub-headings representing each page.

Line 7 includes multiple key-value pairs that get inserted as-is into the
[Hugo
front matter](https://gohugo.io/content-management/front-matter/#front-matter-variables). It largely disables all the "frills" one might typically
associate with a regular blog post - commenting, pagination, metadata, etc.

Line 8 indicates that Hugo should include a link to this content on the
`main` menu of my site, which is currently displayed on the left sidebar
of every page.

Line 9 tells `ox-hugo` to export the files into the `/content/pages`
subdirectory of my Hugo project, which has a slightly different Hugo
template file than a standard blog post.

Line 10 tells `ox-hugo` to manage the `weight` property of the Hugo
front matter data. It will calculate the appropriate relative numbers to
fill in during the export process.

{{< highlight org "linenos=table, linenostart=12" >}}
** Page Title
   :PROPERTIES:
   :EXPORT_FILE_NAME: page-title
   :END:

   Page content
{{< /highlight >}}

To create a new `page` on my Hugo site, I insert a new sub-heading under
the `Pages` heading from the snippet just above. That heading's title is
somewhat arbitrary, but this sub-heading will directly inform the `title`
of the exported content.

Line 14 demonstrates the first truly required property,
`EXPORT_FILE_NAME`, with tells `ox-hugo` what filename under
`/content/pages` to export this sub-tree to. Under my current settings
this also directly determines the actual path portion of the resulting
URL. For example, this one would be visible at `/pages/page-title/`.

Pages can include fairly arbitrary content below the sub-heading,
including further sub-headings to break up a longer page or post. You can
include links, images, and formatting, all using standard Org syntax.
