content/blog/blogging-with-org-mode-and-ox-hugo.md


#### Creating posts {#creating-posts}

{{< highlight org "linenos=table, linenostart=19" >}}
* Posts
  :PROPERTIES:
  :EXPORT_HUGO_SECTION: blog
  :END:
{{< /highlight >}}

As with Pages above, I create a top-level Org heading to contain my
standard blog posts.

Line 20 configures `ox-hugo` to export any sub-headings to
`/content/blog` in my Hugo project, versus `pages` above.

{{< highlight org "linenos=table, linenostart=23" >}}
** Topic                                                             :@topic:
{{< /highlight >}}

I sort my posts into categories by topic and create sub-headings for each
topic, and assign Org tags to each sub-heading that are prefixed with `@`.
Org tags on a post that have an `@` prefix will generate a `category`
entry in the exported front matter, which is one of the [default taxonomies](https://gohugo.io/content-management/taxonomies/#hugo-taxonomy-defaults)
built into a new Hugo project. Org tags are inherited from parent headings
by sub-headings, so all further subheadings under this subheading will
include the `@topic` tag.

{{< highlight org "linenos=table, linenostart=24" >}}
*** DONE Post Title                                               :post:tags:
    CLOSED: [2017-12-19 Tue 17:00]
    :PROPERTIES:
    :EXPORT_DATE: 2017-12-19
    :EXPORT_FILE_NAME: post-title-in-slug-form
    :END:
{{< /highlight >}}

This sub-heading begins a new post, and is marked as **DONE** in Org syntax
with a **CLOSED** timestamp. It also has Org tags named `post` and `tags`
which will be inserted into the exported front matter as `tags`. It
includes an `EXPORT_DATE` property, which would be used as the post's
publication date in the absense of the **CLOSED** timestamp on line 25.
Finally it includes the same `EXPORT_FILE_NAME` property as mentioned
above under Page management.

{{< highlight org "linenos=table, linenostart=31" >}}
Content

More content

#+BEGIN_SRC bash -l 7 :hl_lines 8
  echo 'Some source code content'
  echo 'This line will be highlighted'
  echo "This one won't"
#+END_SRC
{{< /highlight >}}

This snippet demonstrates the syntax needed to include a
syntax-highlighted code snippet within a post. You can quickly start a
code block with <kbd> < s TAB </kbd>.

If you append a valid language to `#+BEGIN_SRC`, and your copy of Emacs
has an associated major mode that is named `$language-mode`, you'll get
automatic syntax highlighting while composing the post, and the exported
markdown will include either the `highlight` [shortcode](https://gohugo.io/content-management/syntax-highlighting/#highlight-shortcode) or [Markdown "code
fences"](https://gohugo.io/content-management/syntax-highlighting/#highlight-in-code-fences). As an added bonus, you can use `org-edit-special` (<kbd>
, ' </kbd> for Spacemacs or <kbd> C-c ' </kbd>
for vanilla Emacs) to open a new popover window that lets you edit that
code snippet in a separate Emacs buffer. This will behave nearly
identically to editing a standalone file with that major mode, including
any extra behavior like auto-complete, linting, etc.


#### Excluding/heading sub-headings from export {#excluding-heading-sub-headings-from-export}

On some posts I like to create a private space to jot down ad hoc notes,
research and reference links, unrefined code snippets, etc. that
shouldn't appear in the final product but are useful to me during the
writing process. By configuring the `org-export-exclude-tags` variable,
or an `EXCLUDE_TAGS` file variable, then inserting a matching Org tag on
a sub-heading, that content will not appear in the exported Markdown or
in the published post, but will remain intact in the original `.org`
file. In my case, it's a `:noexport:` tag.


#### Automatic export on save {#automatic-export-on-save}

The ox-hugo site includes [great documentation](https://ox-hugo.scripter.co/doc/auto-export-on-saving/) for adding a local variable
to your `.org` file to enable automatic "what I mean" export whenever you
save the file.

The resulting syntax after following these instructions is:

{{< highlight org "linenos=table, linenostart=51" >}}
* Footnotes
* COMMENT Local Variables                                           :ARCHIVE:
# Local Variables:
# eval: (add-hook 'after-save-hook #'org-hugo-export-wim-to-md-after-save :append :local)
# eval: (auto-fill-mode 1)
# End:
{{< /highlight >}}


#### Full Sample {#full-sample}

{{< highlight org "linenos=table, linenostart=1, hl_lines=3 4 7 9 10 21 24-29 35-39 44 51-56" >}}
#+STARTUP: content
#+AUTHOR: Shane Sveller
#+HUGO_BASE_DIR: .
#+HUGO_AUTO_SET_LASTMOD: t
* Pages
  :PROPERTIES:
  :EXPORT_HUGO_CUSTOM_FRONT_MATTER: :noauthor true :nocomment true :nodate true :nopaging true :noread true
  :EXPORT_HUGO_MENU: :menu main
  :EXPORT_HUGO_SECTION: pages
  :EXPORT_HUGO_WEIGHT: auto
  :END:
** Page Title
   :PROPERTIES:
   :EXPORT_FILE_NAME: page-title
   :END:

   Page content

* Posts
  :PROPERTIES:
  :EXPORT_HUGO_SECTION: blog
  :END:
** Topic                                                             :@topic:
*** DONE Post Title                                               :post:tags:
    CLOSED: [2017-12-19 Tue 17:00]
    :PROPERTIES:
    :EXPORT_DATE: 2017-12-19
    :EXPORT_FILE_NAME: post-title-in-slug-form
    :END:

    Content

    More Content

    #+BEGIN_SRC bash -l 7 :hl_lines 8
      echo 'Some source code content'
      echo 'This line will be highlighted'
      echo "This one won't"
    #+END_SRC

**** Post Sub-Heading
     This is another section within the post.

*** TODO Draft Post Title
    :PROPERTIES:
    :EXPORT_FILE_NAME: draft-post-title
    :END:

    This article *will* be exported but will be marked ~draft = true~ in the front matter.

* Footnotes
* COMMENT Local Variables                                           :ARCHIVE:
# Local Variables:
# eval: (add-hook 'after-save-hook #'org-hugo-export-wim-to-md-after-save :append :local)
# eval: (auto-fill-mode 1)
# End:
{{< /highlight >}}


### Marking a post as a Draft {#marking-a-post-as-a-draft}

To create a new draft post, add a new heading or subheading, and set it to
**TODO** status, perhaps via `M-x org-todo` or <kbd> C-c C-t
</kbd>.

**TODO** status ensures that the post will be rendered to Markdown with
`draft = true` in its frontmatter, which configures Hugo itself to prevent
a premature publish of the article to your live site unless specifically
instructed to include draft content.

_A heading without **TODO** or **DONE** is **not** considered a draft_.


### Publishing a Draft {#publishing-a-draft}

To publish a draft post, toggle its **TODO** state to **DONE**. If you have
`org-log-done` set to `'time`, toggling to **DONE** automatically adds a
**CLOSED:** timestamp that will be respected in favor of `EXPORT_DATE`
property for setting the `date` in the rendered post's front matter.
