content/blog/blogging-with-org-mode-and-ox-hugo.md


### Optional: Live reload without a separate shell tab {#prodigy-hugo-service}

If you enable the `prodigy` layer in Spacemacs, or install the `Prodigy`
package manually, you can define a process in your
`dotspacemacs/user-config` function like so:

{{< highlight emacs-lisp "linenos=table, linenostart=1" >}}
(prodigy-define-service
  :name "Hugo Personal Blog"
  :command "/usr/local/bin/hugo"
  :args '("server" "-D" "--navigateToChanged" "-t" "hugo-redlounge")
  :cwd "~/src/shanesveller-dot-com"
  :tags '(personal)
  :stop-signal 'sigkill
  :kill-process-buffer-on-stop t)
{{< /highlight >}}

Then, to manage the process while editing with Emacs, I use <kbd> SPC a
S </kbd> to open the Prodigy buffer, highlight the service entry, and
use <kbd> s </kbd> to start the process, <kbd> S
</kbd> to stop the service, and <kbd> $ </kbd> to
view process output. <kbd> q </kbd> will back out of any
Prodigy-generated buffers.


## Software/Tool Versions {#ox-hugo-software-tool-versions}

| Software  | Version       |
|-----------|---------------|
| Emacs     | 25.3.1        |
| Spacemacs | 0.300.0       |
| Org       | 9.1.2         |
| Hugo      | 0.31.1        |
| ox-hugo   | 20171026.1402 |
| prodigy   | 20170816.1114 |


## Emacs Lisp Snippets {#emacs-lisp-snippets}

Here's a snippet that can build off of [the Prodigy service snippet](#prodigy-hugo-service) to
automatically visit your local Hugo server in a browser once it's running.

I'm still learning emacs-lisp, and will probably find in the future that
this style doesn't suit me, particularly the trailing parentheses.

I'd also like to investigate `defcustom` to allow these default values to
be more configurable.

```emacs-lisp
(defun browse-hugo-maybe ()
  (interactive)
  (let ((hugo-service-name "Hugo Personal Blog")
        (hugo-service-port "1313"))
    (if (prodigy-service-started-p (prodigy-find-service hugo-service-name))
        (progn
          (message "Hugo detected, launching browser...")
          (browse-url (concat "http://localhost:" hugo-service-port))))))
```


## Credits {#credits}

Thank you to [Justin Nauman](https://twitter.com/jrnt30) for great feedback on an early version of this
article. Any remaining flaws are my own.
